In [1]:
a=2

In [18]:
flight={"Flight":[439,921,114],
    "Date":["12/11/2017","12/11/2017","12/12/2017"]}

In [14]:
flight

{'Flight': [439, 921, 114], 'Date': ['hj', 'bj', 'lj']}

In [20]:
import pandas as pd

In [21]:
ftframe=pd.DataFrame(flight)

In [23]:
ftframe.index=["F123D11","F345D11","F123D12"]

In [24]:
ftframe

         Flight        Date
F123D11     439  12/11/2017
F345D11     921  12/11/2017
F123D12     114  12/12/2017

In [25]:
ftframe2=pd.read_csv("C:\\Users\\cbvisitor4\\Downloads\\dataset\\flight.csv")

In [26]:
ftframe2

  Unnamed: 0  Flight        Date Dest  FirstClass  Economy
0    F439D11     439  12/11/2017  LAX          20      137
1    F921D11     921  12/11/2017  DFW          20      131
2    F114D12     114  12/12/2017  LAX          15      170
3    F982D12     982  12/12/2017  dfw           5       85
4    F439D13     439  12/13/2017  LAX          14      196
5    F982D13     982  12/13/2017  DFW          15      116
6    F431D14     431  12/14/2017  LaX          17      166
7    F982D14     982  12/14/2017  DFW           7       88
8    F114D15     114  12/15/2017  LAX          12      187
9    F982D15     982  12/15/2017  DFW          14       31

In [27]:
ftframe2=pd.read_csv("C:\\Users\\cbvisitor4\\Downloads\\dataset\\flight.csv",index_col=0)

In [28]:
ftframe2

         Flight        Date Dest  FirstClass  Economy
F439D11     439  12/11/2017  LAX          20      137
F921D11     921  12/11/2017  DFW          20      131
F114D12     114  12/12/2017  LAX          15      170
F982D12     982  12/12/2017  dfw           5       85
F439D13     439  12/13/2017  LAX          14      196
F982D13     982  12/13/2017  DFW          15      116
F431D14     431  12/14/2017  LaX          17      166
F982D14     982  12/14/2017  DFW           7       88
F114D15     114  12/15/2017  LAX          12      187
F982D15     982  12/15/2017  DFW          14       31

In [29]:
ftframe2["Flight"]

F439D11    439
F921D11    921
F114D12    114
F982D12    982
F439D13    439
F982D13    982
F431D14    431
F982D14    982
F114D15    114
F982D15    982
Name: Flight, dtype: int64

In [30]:
type(ftframe2["Flight"])

pandas.core.series.Series

In [31]:
type(ftframe2[["Flight"]])

pandas.core.frame.DataFrame

In [32]:
ftframe2[["Flight","Dest"]]

         Flight Dest
F439D11     439  LAX
F921D11     921  DFW
F114D12     114  LAX
F982D12     982  dfw
F439D13     439  LAX
F982D13     982  DFW
F431D14     431  LaX
F982D14     982  DFW
F114D15     114  LAX
F982D15     982  DFW

In [33]:
ftframe[1:4]

         Flight        Date
F345D11     921  12/11/2017
F123D12     114  12/12/2017

In [34]:
ftframe2[1:4]

         Flight        Date Dest  FirstClass  Economy
F921D11     921  12/11/2017  DFW          20      131
F114D12     114  12/12/2017  LAX          15      170
F982D12     982  12/12/2017  dfw           5       85

In [36]:
ftframe2.loc["F982D14"]

Flight               982
Date          12/14/2017
Dest                 DFW
FirstClass             7
Economy               88
Name: F982D14, dtype: object

In [37]:
ftframe2.loc[["F982D14"]]

         Flight        Date Dest  FirstClass  Economy
F982D14     982  12/14/2017  DFW           7       88

In [40]:
ftframe2.iloc[[0,1,3]]

         Flight        Date Dest  FirstClass  Economy
F439D11     439  12/11/2017  LAX          20      137
F921D11     921  12/11/2017  DFW          20      131
F982D12     982  12/12/2017  dfw           5       85

In [41]:
ftframe2.iloc[:,[2,4]]

        Dest  Economy
F439D11  LAX      137
F921D11  DFW      131
F114D12  LAX      170
F982D12  dfw       85
F439D13  LAX      196
F982D13  DFW      116
F431D14  LaX      166
F982D14  DFW       88
F114D15  LAX      187
F982D15  DFW       31

In [42]:
ftframe2["Length"]= ftframe2["Dest"].apply(len)

In [43]:
print(ftframe2)

         Flight        Date Dest  FirstClass  Economy  Length
F439D11     439  12/11/2017  LAX          20      137       3
F921D11     921  12/11/2017  DFW          20      131       3
F114D12     114  12/12/2017  LAX          15      170       3
F982D12     982  12/12/2017  dfw           5       85       3
F439D13     439  12/13/2017  LAX          14      196       3
F982D13     982  12/13/2017  DFW          15      116       3
F431D14     431  12/14/2017  LaX          17      166       3
F982D14     982  12/14/2017  DFW           7       88       3
F114D15     114  12/15/2017  LAX          12      187       3
F982D15     982  12/15/2017  DFW          14       31       3

In [50]:
ftframe2["abc"]=4

In [51]:
print (ftframe2)

         Flight        Date Dest  FirstClass  Economy  Length  abc  total
F439D11     439  12/11/2017  LAX          20      137       3    4    157
F921D11     921  12/11/2017  DFW          20      131       3    4    151
F114D12     114  12/12/2017  LAX          15      170       3    4    185
F982D12     982  12/12/2017  dfw           5       85       3    4     90
F439D13     439  12/13/2017  LAX          14      196       3    4    210
F982D13     982  12/13/2017  DFW          15      116       3    4    131
F431D14     431  12/14/2017  LaX          17      166       3    4    183
F982D14     982  12/14/2017  DFW           7       88       3    4     95
F114D15     114  12/15/2017  LAX          12      187       3    4    199
F982D15     982  12/15/2017  DFW          14       31       3    4     45

In [52]:
ftframe2["total"]=ftframe2["FirstClass"]+ftframe2["Economy"]

In [53]:
print (ftframe2)

         Flight        Date Dest  FirstClass  Economy  Length  abc  total
F439D11     439  12/11/2017  LAX          20      137       3    4    157
F921D11     921  12/11/2017  DFW          20      131       3    4    151
F114D12     114  12/12/2017  LAX          15      170       3    4    185
F982D12     982  12/12/2017  dfw           5       85       3    4     90
F439D13     439  12/13/2017  LAX          14      196       3    4    210
F982D13     982  12/13/2017  DFW          15      116       3    4    131
F431D14     431  12/14/2017  LaX          17      166       3    4    183
F982D14     982  12/14/2017  DFW           7       88       3    4     95
F114D15     114  12/15/2017  LAX          12      187       3    4    199
F982D15     982  12/15/2017  DFW          14       31       3    4     45

In [54]:
check=ftframe2["FirstClass"]<10

In [55]:
type(check)

pandas.core.series.Series

In [56]:
ftframe2[check]

         Flight        Date Dest  FirstClass  Economy  Length  abc  total
F982D12     982  12/12/2017  dfw           5       85       3    4     90
F982D14     982  12/14/2017  DFW           7       88       3    4     95

In [60]:
nu.logical_and(ftframe2["FirstClass"]>=10, ftframe2["Economy"]>160)

F439D11    False
F921D11    False
F114D12     True
F982D12    False
F439D13     True
F982D13    False
F431D14     True
F982D14    False
F114D15     True
F982D15    False
Name: FirstClass, dtype: bool

In [85]:
import numpy as np

In [61]:
x=0

In [62]:
while x<5 :
    x=x+1
    print(x)
    print("H")
print("End")

1
H
2
H
3
H
4
H
5
H
End

In [64]:
for x in range (9):
    print(x)

0
1
2
3
4
5
6
7
8

In [67]:
FC=ftframe2["FirstClass"]
FC

F439D11    20
F921D11    20
F114D12    15
F982D12     5
F439D13    14
F982D13    15
F431D14    17
F982D14     7
F114D15    12
F982D15    14
Name: FirstClass, dtype: int64

In [72]:
for x in FC:
    print(x)

20
20
15
5
14
15
17
7
12
14

In [70]:
t1=0
for tot in FC :
    t1=t1+tot
    print(t1)
print("total",t1)

20
40
55
60
74
89
106
113
125
139
total 139

In [71]:
for i in "pythinfdhsjhjhjfsjbhjhdjshjfjfjh":
    print(i,capitalize())

NameError: name 'capitalize' is not defined

In [75]:
for (Date) in ftframe2.iterrows():
    print(Date)

('F439D11', Flight               439
Date          12/11/2017
Dest                 LAX
FirstClass            20
Economy              137
Length                 3
abc                    4
total                157
Name: F439D11, dtype: object)
('F921D11', Flight               921
Date          12/11/2017
Dest                 DFW
FirstClass            20
Economy              131
Length                 3
abc                    4
total                151
Name: F921D11, dtype: object)
('F114D12', Flight               114
Date          12/12/2017
Dest                 LAX
FirstClass            15
Economy              170
Length                 3
abc                    4
total                185
Name: F114D12, dtype: object)
('F982D12', Flight               982
Date          12/12/2017
Dest                 dfw
FirstClass             5
Economy               85
Length                 3
abc                    4
total                 90
Name: F982D12, dtype: object)
('F439D13', Flight               439
Date          12/13/2017
Dest                 LAX
FirstClass            14
Economy              196
Length                 3
abc                    4
total                210
Name: F439D13, dtype: object)
('F982D13', Flight               982
Date          12/13/2017
Dest                 DFW
FirstClass            15
Economy              116
Length                 3
abc                    4
total                131
Name: F982D13, dtype: object)
('F431D14', Flight               431
Date          12/14/2017
Dest                 LaX
FirstClass            17
Economy              166
Length                 3
abc                    4
total                183
Name: F431D14, dtype: object)
('F982D14', Flight               982
Date          12/14/2017
Dest                 DFW
FirstClass             7
Economy               88
Length                 3
abc                    4
total                 95
Name: F982D14, dtype: object)
('F114D15', Flight               114
Date          12/15/2017
Dest                 LAX
FirstClass            12
Economy              187
Length                 3
abc                    4
total                199
Name: F114D15, dtype: object)
('F982D15', Flight               982
Date          12/15/2017
Dest                 DFW
FirstClass            14
Economy               31
Length                 3
abc                    4
total                 45
Name: F982D15, dtype: object)

In [76]:
for i,j in ftframe2.iterrows():
    print(i)
    # i= index
    print(j)
    #jidk

F439D11
Flight               439
Date          12/11/2017
Dest                 LAX
FirstClass            20
Economy              137
Length                 3
abc                    4
total                157
Name: F439D11, dtype: object
F921D11
Flight               921
Date          12/11/2017
Dest                 DFW
FirstClass            20
Economy              131
Length                 3
abc                    4
total                151
Name: F921D11, dtype: object
F114D12
Flight               114
Date          12/12/2017
Dest                 LAX
FirstClass            15
Economy              170
Length                 3
abc                    4
total                185
Name: F114D12, dtype: object
F982D12
Flight               982
Date          12/12/2017
Dest                 dfw
FirstClass             5
Economy               85
Length                 3
abc                    4
total                 90
Name: F982D12, dtype: object
F439D13
Flight               439
Date          12/13/2017
Dest                 LAX
FirstClass            14
Economy              196
Length                 3
abc                    4
total                210
Name: F439D13, dtype: object
F982D13
Flight               982
Date          12/13/2017
Dest                 DFW
FirstClass            15
Economy              116
Length                 3
abc                    4
total                131
Name: F982D13, dtype: object
F431D14
Flight               431
Date          12/14/2017
Dest                 LaX
FirstClass            17
Economy              166
Length                 3
abc                    4
total                183
Name: F431D14, dtype: object
F982D14
Flight               982
Date          12/14/2017
Dest                 DFW
FirstClass             7
Economy               88
Length                 3
abc                    4
total                 95
Name: F982D14, dtype: object
F114D15
Flight               114
Date          12/15/2017
Dest                 LAX
FirstClass            12
Economy              187
Length                 3
abc                    4
total                199
Name: F114D15, dtype: object
F982D15
Flight               982
Date          12/15/2017
Dest                 DFW
FirstClass            14
Economy               31
Length                 3
abc                    4
total                 45
Name: F982D15, dtype: object

In [78]:
#nu.mean(hei_wei[2]) or(jdhjhj[:,1])
#nu.corrcoef()
#nu.std
#nu.median()
#sum()
#sort()

In [89]:
#rand num
#pkg.ramdom.rand()
#pkg.random.seed(seed_no)
#pkg.ramdom.randint(start(number),end(index))
        (0,2)--1
        (1,3)--2
#(0),1,2,3,4,5,6,7,8,9
#1,(2),3,4,5,6,7,8,9

IndentationError: unexpected indent (<ipython-input-89-7ed8725a1d7c>, line 5)

In [88]:
np.random.rand()

0.343345007113508

In [90]:
np.random.randint(0,15)

7

In [91]:
nu.random.seed(123)
ht=nu.random.randint(0,2)
outcomes=[]
if ht=

SyntaxError: invalid syntax (<ipython-input-91-234890941052>, line 4)

In [93]:
import numpy as nu
heli=nu.random.normal(mean)

NameError: name 'mean' is not defined